
#ifndef __YX23F01CB_GeneralKey_Touch_Lib_CFG_H__
#define __YX23F01CB_GeneralKey_Touch_Lib_CFG_H__

/**********************************************IC型号及封装选择**********************************************/
//		[0 ----> YX23F01CB	SOP20/DIP20]
//		[1 ----> YX23F01CB	SOP24]
//		[2 ----> YX23F01CB	SOP28]
//		[3 ----> YX23F01CB	SOP16]

#define HCTouchLib_IC_BODY                    			2
/************************************************************************************************************/



/*********************************************设置触摸相关寄存器*********************************************/
	
//      设置数据采样时钟个数(0~255) 单个通道扫描时间 ≈ ((HCTouchLib_DSCR+1)*256 - 1)/(Fosc/2)
#define HCTouchLib_DSCR                                 120

//      设置充放电频率(0~3)         0->Fosc/2，1->Fosc/4，2->Fosc/8，3->Fosc/16
#define HCTouchLib_PRSDIV                               1

//      设置触摸充电电源电压(0~3)   0->2v 1->2.5v 2->3v 3->4v，充电电压越大，触摸计数值越大
//      使用注意：必须保证芯片VDD电压 > 用户设置触摸充电电源电压+0.5V
#define HCTouchLib_VD                                   2

//      设置触摸放电电阻(0~7)       0->放电电阻最小, 7->放电电阻最大,方向0(小)-->7(大), 放电电阻越小,RawData值越小
#define HCTouchLib_RBS                                  5
/************************************************************************************************************/



/*********************************************设置需要检测的通道*********************************************/
//      设置需要检测的通道标志 ------>[0: 不检测；1: 允许检测]

//		YX23F01CB-SOP28 			│TK15│TK14│TK13│TK12│TK11│TK10│TK9 │TK8 │TK7 │TK6 │TK5 │TK4 │TK3 │TK2 │TK1 │TK0 │
//		YX23F01CB-SOP24 			│ NC │ NC │ NC │ NC │TK15│TK14│TK13│TK12│TK11│TK10│TK9 │TK7 │TK3 │TK2 │TK1 │TK0 │
//		YX23F01CB-SOP20/DIP20		│ NC │ NC │ NC │ NC │ NC │ NC │TK15│TK14│TK13│TK12│TK11│TK10│TK9 │TK7 │TK3 │TK2 │
//		YX23F01CB-SOP16				│ NC │ NC │ NC │ NC │ NC │ NC │ NC │ NC │ NC │TK15│TK14│TK13│TK12│TK11│TK7 │TK2 │
#define HCTouchLib_TK_CH_MASK  TKBIN(  1 ,  1 ,  1 ,  1 ,  1 ,  1 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 )

//      设置短按按键及长按按键 ------>[0: 短按按键  1: 长按按键]
//		使用注意：本配置必须配合长/短按键生效最长时间使用
#define HCTouchLib_TK_LONGKEY  TKBIN( 0  ,  0  , 0 ,  0  , 0  , 0  , 0  , 0  , 0  , 0  , 0  , 0  , 0  , 0  , 0  , 0  )

//      噪声阈值(5~50)              建议该值为最大噪声的绝对值的1.5倍
#define HCTouchLib_NOISE_THRESHOLD 	{ 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 , 10 }

//      触摸阈值(25~65535)          至少为通道噪声值3倍以上,5倍以上更佳
#define HCTouchLib_FINGER_THRESHOLD	{ 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120}

//      触摸迟滞(5~50)              与触摸阈值配合使用，该值应略大于所设噪声阈值
#define HCTouchLib_HYSTERESIS                           15	

//      触摸有效上限值(0~255)       上限值 = HCTouchLib_LIMIT_FACTOR × 对应通道的触摸阈值，0表示不设置上限
#define HCTouchLib_LIMIT_FACTOR                         0

//      按键确认消抖次数(1~255)		按下消抖时间 = 单个按键扫描时间 × 开启的检测通道个数 × 按键确认消抖次数
#define HCTouchLib_CONFIRM_TOUCH_TIME                   2

//      按键离开消抖次数(1~255)		松开消抖时间 = 单个按键扫描时间 × 开启的检测通道个数 × 按键离开消抖次数
#define HCTouchLib_CONFIRM_NOTOUCH_TIME                 2
/************************************************************************************************************/



/********************************************设置基线更新相关参数********************************************/
//                                                                   Differ																	 																	 														 
//      一轮扫描时间 = 单个通道扫描时间 × 开启的检测通道个数            ↑					
//      区域I，区域II，区域IV 的更新时间 ≈ 设置值 × 一轮扫描时间   │         │
//      区域III的微调原理 ：│Differ累加值│ > 设置值 时 基线微调    │         │
//-----------------------------------------------------------------│---------│----------------------------------------触摸有效上限值
//      设置短按键生效最长时间(0~2000)                             │         │Differ>触摸阈值+迟滞时，内部计数器累加值
#define HCTouchLib_CONFIRM_SHORTTOUCH_TIME              1000    // │         │超过区域I设置值后，按键无效，更新基线																			 
//                                                                 │    I    │      
//      设置长按键生效最长时间(SHORTTOUCH_TIME~65535)              │         │																	 
#define HCTouchLib_CONFIRM_LONGTOUCH_TIME               2000    // │         │																			 
//                                                                 │         │																		 
//-----------------------------------------------------------------│---------│----------------------------------------触摸阈值
//      设置阈值噪声更新时间(0~65535)                              │         │Differ在正噪声与触摸阈值之间时，内部计数	
#define HCTouchLib_THRESHOLD_NOISE_TIME                 100     // │   II    │器累加值超过区域II设置值后，按键无效，更	         															 
//                                                                 │         │新基线																			 
//-----------------------------------------------------------------│---------│----------------------------------------正噪声值				 
//      设置基线微调速度(0~255)                                    │         │Differ在±噪声之间时，内部噪声桶累加噪声，
#define HCTouchLib_NOISE_BARREL_CAPACITY                80      // │   III   │累加和的绝对值超过设置值后基线微调，在湿     
//                                                                 │         │度及温度变化较快时建议将其设置的更小
//-----------------------------------------------------------------│---------│----------------------------------------负噪声值
//      设置低基准线复位时间(0~255)                                │         │Differ<负噪声值是，内部计数器累加值超过区
#define HCTouchLib_OVERLOW_TIME                         100     // │   IV    │域IV设置值后，按键无效，更新基线	   																				
/************************************************************************************************************/

#define HCTouchLib_ANTI_CS_SCAN_SW						0

/****************************************************************************************************/

#endif /*__YX23F01CB_GeneralKey_Touch_Lib_CFG_H__*/

/******************************************************************************************************

 ******************************************************************************************************/
