
#ifndef __YX23F01CB_GeneralKey_Touch_Auxiliary_H__
#define __YX23F01CB_GeneralKey_Touch_Auxiliary_H__


/****************************************************************************************************/
void TouchRawDataFilter(void);			//触摸RawData滤波函数，此函数必须添加在main.c中，否则程序无法正常运行
void TouchMultibuttonHandle(void);		//组合按键处理，一共三种模式
/****************************************************************************************************/

// 设置RawData滤波深度，打开后系统会对RawData采用递推中位值平均滤波，即对递推数组进行排序后去除最高值和最低值，然后对剩余数据计算平均值
//			0：关闭滤波功能
//			3->15：设置滤波数组长度，如设置为5，则对RawData数据进行排序，然后去除最高值和最低值，剩余的3个数据计算平均得到最终值
#define HCTouchLib_FILTER_DEPTH			0
/****************************************************************************************************/

/****************************************************************************************************/

// 设置按键模式选择
//			0：多按键模式，支持多个按键同时有效			
//			1：单按键模式，多个按键同时有效时，仅有信号最强(Differ值最大)的按键有效，其他按键无效
//			2：双按键模式，同一时间内最多有两个按键有效，且必须为用户设置的组合按键
#define HCTouchLib_MULTIBUTTON 			0

	
// 设置双按键组成元素，最多提供四组组合按键，必须配合双按键模式使用
//			举例：如果TK0和TK1作为组合按键则在{}填入0,1，如不需使用，填入两个相同值即可
#define HCTouchLib_COMBINATIONKEYA      {2,3}
#define HCTouchLib_COMBINATIONKEYB      {4,5}
#define HCTouchLib_COMBINATIONKEYC      {6,7}
#define HCTouchLib_COMBINATIONKEYD      {8,9}

#endif

/******************************************************************************************************

 ******************************************************************************************************/